Revit 2016 API
DuctSizes.GetEnumerator Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual IEnumerator<MEPSize> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of MEPSize)
Visual C++
public:
virtual IEnumerator<MEPSize^>^ GetEnumerator()
Return Value
An IEnumerator(MEPSize) object that can be used to iterate through key-value pairs in the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace